In [2]:
import pandas as pd
import numpy as np

In [3]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                            title  year
0                        Anita B.  2014
1                   Bloody Border  2013
2  Mademoiselle Josette, ma femme  1914
3                   Super Heal Me  2014
4         R and J: The True Story  2012

In [4]:
cast_1 = pd.read_csv("data/cast/cast_1.csv")
cast_2 = pd.read_csv("data/cast/cast_2.csv")
cast_3 = pd.read_csv("data/cast/cast_3.csv")

cast = pd.concat([cast_1, cast_2, cast_3])
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [5]:
# What are the ten most common movie names of all time?

titles.title.value_counts().head(10)

Hamlet                  20
Carmen                  17
Macbeth                 16
Temptation              12
The Outsider            12
Maya                    12
Othello                 11
The Three Musketeers    11
Honeymoon               11
Freedom                 11
Name: title, dtype: int64

In [6]:
# Which three years of the 1930s saw the most films released?

t = titles
t = t[t.year // 10 == 193]
t.year.value_counts().head(3)

1937    1180
1936    1116
1938    1115
dtype: int64

In [5]:
# Find the number of films that have been released each decade
# over the history of cinema.

t = titles
sol = (t.year // 10 * 10).value_counts().sort_index()
sol

1890        3
1900       39
1910     6799
1920     9034
1930    10388
1940     8718
1950    12934
1960    17976
1970    19526
1980    21034
1990    22992
2000    39452
2010    75733
2020      285
2110        1
Name: year, dtype: int64

In [6]:
# Find the number of "Hamlet" films made each decade.

t = titles
t = t[t.title == 'Hamlet']
sol = (t.year // 10 * 10).value_counts().sort_index()
sol

1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    5
Name: year, dtype: int64

In [9]:
# Find the number of "Rustler" characters
# in each decade of the history of film.

c = cast
c = c[c.character == 'Rustler']
sol = (c.year // 10 * 10).value_counts().sort_index()
sol

1920     6
1930    84
1940    18
1950     8
1960     2
1970     9
1980     1
1990     4
2000     2
Name: year, dtype: int64

In [8]:
# Find the number of "Hamlet" characters each decade.

c = cast
c = c[c.character == 'Hamlet']
sol = (c.year // 10 * 10).value_counts().sort_index()
sol

1910     6
1920     1
1930     6
1940     1
1950     4
1960     7
1970     8
1980     2
1990    11
2000    19
2010    31
Name: year, dtype: int64

In [11]:
# What are the 11 most common character names in movie history?

cast.character.value_counts().head(11)

Himself        18630
Dancer         10864
Extra           8474
Reporter        7483
Doctor          6643
Policeman       6399
Student         6158
Nurse           6039
Bartender       5986
Party Guest     5620
Zombie          5573
dtype: int64

In [12]:
# Who are the 10 people most often credited as "Herself" in film history?

c = cast
c[c.character == 'Herself'].name.value_counts().head(10)

Joyce Brothers         14
Queen Elizabeth II     10
Margaret Thatcher       8
Joan Rivers             7
Mary Jo Pehl            7
Kareena Kapoor          5
Chris Evert             5
Sally Jessy Raphael     5
Caroline Rhea           5
Marilyn Monroe          5
dtype: int64

In [13]:
# Who are the 10 people most often credited as "Himself" in film history?

c = cast
c[c.character == 'Himself'].name.value_counts().head(10)

Adolf Hitler             91
Richard Nixon            38
Ronald Reagan            28
John F. Kennedy          26
Ron Jeremy               22
George W. Bush           20
Franklin D. Roosevelt    20
Bill Clinton             20
Winston Churchill        20
Martin Luther King       19
dtype: int64

In [14]:
# Which actors or actresses appeared in the most movies in the year 1945?

cast[cast.year == 1945].name.value_counts().head(10)

Emmett Vogan       39
Sam (II) Harris    30
Bess Flowers       28
Harold Miller      28
Nolan Leary        27
Frank O'Connor     26
Franklyn Farnum    24
Edmund Cobb        24
Tom London         24
Pierre Watkin      24
dtype: int64

In [15]:
# Which actors or actresses appeared in the most movies in the year 1985?

cast[cast.year == 1985].name.value_counts().head(10)

Shakti Kapoor       19
Mammootty           17
Sukumari            16
Lou Scheimer        15
Aruna Irani         14
Rajesh Khanna       13
Mohanlal            13
Deven Verma         13
Raj Babbar          13
Satyendra Kapoor    12
dtype: int64

In [7]:
# Find how many roles Mammootty has played in each year of his career.

sol = cast[cast.name == 'Mammootty'].year.value_counts().sort_index()
sol

1971     1
1980     2
1981     3
1982     7
1983    18
1984    16
1985    22
1986    18
1987    10
1988     7
1989    10
1990    16
1991     6
1992     3
1993     5
1994     5
1995     5
1996     5
1997     2
1998     4
1999     4
2000     7
2001     3
2002     3
2003     2
2004     8
2005     6
2006     8
2007     7
2008     9
2009    12
2010     9
2011     7
2012     7
2013     5
2014     6
2015     6
2016     4
2017     2
Name: year, dtype: int64

In [17]:
# What are the 10 most frequent roles that start with the phrase "Patron in"?

c = cast
c[c.character.str.startswith('Patron in ')].character.value_counts().head(10)

Patron in Frisky Rabbit         16
Patron in the Coffee House       9
Patron in Chinese Restaurant     9
Patron in Billiard Parlor        5
Patron in Bar                    4
Patron in cabaret                3
Patron in restaurant             3
Patron in Restaurant             3
Patron in Club                   3
Patron in Coffee Shop            2
dtype: int64

In [18]:
# What are the 10 most frequent roles that start with the word "Science"?

c = cast
c[c.character.str.startswith('Science')].character.value_counts().head(10)

Science Teacher         53
Science Fair Student     8
Science Student          7
Science Fair Judge       6
Science Club Member      5
Science Reporter         5
Science Kid              4
Science Promo Cadet      4
Science Officer          3
Science teacher          3
dtype: int64